app/Models/Kota.php

SELECT *
FROM `tab_kota`
---
    public function tab_kota(){
        return $this->findAll();